Examinator/src/InformationRegisters/ГруппыОбъектовСУЗ/ГруппыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГруппыОбъектовСУЗ</name>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ТерминыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
      <types>CatalogRef.РубрикаторыСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ГруппыОбъектовСУЗ/ManagerModule.bsl
Функция ГруппаДляХраненияПодчиненныхЭлементов(СсылкаНаОбъект, ТипПодчиненногоЭлемента) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект)
		ИЛИ НЕ ЗначениеЗаполнено(ТипПодчиненногоЭлемента) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	// Определяем тип группы
	
	Если ТипЗнч(ТипПодчиненногоЭлемента) = Тип("Строка") Тогда
		ТипПодчиненногоЭлемента = Тип(ТипПодчиненногоЭлемента);
	КонецЕсли;
	
	Если ТипЗнч(ТипПодчиненногоЭлемента) = Тип("ОписаниеТипов") Тогда
		
		МассивТипов = ТипПодчиненногоЭлемента.Типы();
		
		Если МассивТипов.Количество() = 0 ИЛИ МассивТипов.Количество() > 1 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ТипПодчиненногоЭлемента = МассивТипов[0];
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ГруппыОбъектовСУЗ.Группа КАК Группа
		|ИЗ
		|	РегистрСведений.ГруппыОбъектовСУЗ КАК ГруппыОбъектовСУЗ
		|ГДЕ
		|	ГруппыОбъектовСУЗ.СсылкаНаОбъектСУЗ = &СсылкаНаОбъектСУЗ
		|	И ТИПЗНАЧЕНИЯ(ГруппыОбъектовСУЗ.Группа) = &Тип";

	Запрос.УстановитьПараметр("Тип", ТипПодчиненногоЭлемента);
	Запрос.УстановитьПараметр("СсылкаНаОбъектСУЗ", СсылкаНаОбъект);

	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.Группа;
		
	КонецЕсли;
	
КонецФункции

Процедура СохранитьГруппуДляХраненияПодчиненныхЭлементов(СсылкаНаОбъект, Группа) Экспорт
	
	НаборЗаписей = РегистрыСведений.ГруппыОбъектовСУЗ.СоздатьНаборЗаписей();
		
	НаборЗаписей.Отбор.СсылкаНаОбъектСУЗ.Установить(СсылкаНаОбъект);
	НаборЗаписей.Отбор.Группа.Установить(Группа);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	НоваяЗапись.СсылкаНаОбъектСУЗ = СсылкаНаОбъект;
	НоваяЗапись.Группа = Группа;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ВсеГруппыЭлектронногоКурса(Знач ЭлектронныйКурс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыОбъектовСУЗ.Группа КАК Группа
		|ИЗ
		|	РегистрСведений.ГруппыОбъектовСУЗ КАК ГруппыОбъектовСУЗ
		|ГДЕ
		|	ГруппыОбъектовСУЗ.СсылкаНаОбъектСУЗ = &ЭлектронныйКурс";
	
	Запрос.УстановитьПараметр("ЭлектронныйКурс", ЭлектронныйКурс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Группа");
	
КонецФункции
